import { useState } from 'react';
import { Link } from 'react-router-dom';
import CardType from '../../types/CardType';
import Container from 'react-bootstrap/Container';
import Row from 'react-bootstrap/Row';
import Col from 'react-bootstrap/Col';
import image from '../../assets/coffee.jpg';

import './CustomCard.scss';
import ShowCard, { ShowCardProps } from '../ShowCard/ShowCard';

const CustomCard = () => {
  const [modalShow, setModalShow] = useState<boolean>(false);
  const onShow = () => setModalShow(true);
  const onHide = () => setModalShow(false);

  const data: CardType[] = [
    {
      id: 1,
      image: image,
      title: 'تعدد العملات',
      desc: 'إمكانية التعامل مع عدد غير محدّد من العملات، مع إمكانية التحكم بأسعار الصرف وتقارير تفصيلية خاصة بالعملات و دفتر أستاذ عملة، و تقرير فروقات أسعار الصرف لتوليد قيد مباشر بفروقات الصرف المتولّدة عن العمليات المالية خلال الفترة المحاسبية',
    },
    {
      id: 2,
      image: image,
      title: 'إدارة الأصول',
      desc: 'تعتبر إدارة الأصول الثابتة عملية محاسبية تسعى لتتبع الأصول بغرض المحاسبة المالية، بالإضافة إلى اعتبارها المرجع الأساسي لتنظيم إدخال و اهتلاك الأصول و الممتلكات الخاصة بالمنشأة، تشمل الأصول الثابتة الأراضي و المباني و السيارات و الأثاث و المعدات المكتبية و الآلات، كما و يعتبر نظام متكامل لإدارة البيانات المتعلقة بتلك الأصول ضمن المنشأة ابتداءاً من حاجة المنشآت لإدخال أصول جديدة ومن ثم احتساب قيمة الموجودات و الإهتلاكات لها على مدار السنوات حتى انتهاء الأصل من خلال التصرف به أو استبعاده من سجلات المنشأة، بالإضافة إلى أن النظام يمتاز بسهولة وشمولية عالية في تعريف الأصول و مجموعاتها و الأقسام التابعة لها تلك الأصول',
    },
    {
      id: 3,
      image: image,
      title: 'المستودعات',
      desc: 'يتميز نظام المستودعات بإمكانية إدارة جرد لمستودعات المنشأة، و العمليات المستودعية والجرد المستمر بغض النظر عن حجم تلك المنشأة، كما ويعمل وفق آلية سلسة و تراتبية منظمة ابتداءاً من إدخال بضاعة أول المدة حتى استخراج ميزانية متكاملة، و يتميز النظام أيضاً بإمكانية حسب تكلفة المواد حسب المستودعات، و إظهار تقارير لجرد المستودعات و تقارير شهرية لحركة المواد ضمن المستودعات،و تخصيص حدود للمواد حسب المستودعات،و تفعيلها ضمن الفواتير بالإضافة إلى إمكانية التحكم بصلاحية المستخدمين من خلال موسع الصلاحيات',
    },
    {
      id: 4,
      image: image,
      title: 'نظام العمولات للبائعين',
      desc: 'يستخدم تقرير عمولات البائعين لإظهار عمولة بائع محدّد خلال فترة زمينة معينة مع إمكانية التحكم بنوع الفواتير من خلال خيارات الإظهار و العملة المراد إظهار قيمة العمولة بها و من ثم توليد سند قيد بقيمة نتيجة العمولة, كما ويمكن من خلال تقرير عمولات البائعين التحكم بنوع العمولات المراد دفعها للبائع المحدّد من خلال خيارات التقرير حيث من الممكن احتساب عمولة واحدة فقط على الرغم من وجود عدّة أنواع للعمولات في بطاقة البائع',
    },
    {
      id: 5,
      image: image,
      title: 'مصمم الطباعة',
      desc: 'وجود مصمم الفاست ريبورت و الذي يعتبر أداة مساعدة لطباعة التقارير و التحكم بطريقة عرضها بما يتناسب مع رغبة وحاجة العميل',
    },
    {
      id: 6,
      image: image,
      title: 'دعم الفروع',
      desc: 'دعم ربط نظام الفروع أياً كان موقعها مع إمكانية عمل تقارير خاصة بكل فرع حدة ( ميزانية كل فرع على حدة أو ميزان إجمالية لكامل الشركة مع فروعها',
    },
    {
      id: 7,
      image: image,
      title: 'المخططات البيانية',
      desc: 'يتميز بوجود مخطط بيانية لأرصدة الحسابات حسب فترات يمكن التحكم بها من قبل العميل و ذلك لاستعراض أرصدة العملاء دون العودة لتقارير البرنامج. إمكانية التحكم بطريقة عرض المخطط على سطح المكتب كمخطط أعمدة أو مخطط أعمدة ثلاثي الأبعاد و غير ذلك.',
    },
    {
      id: 9,
      image: image,
      title: 'الأرقام التسلسلية',
      desc: 'يتضمن البرنامج ميزة الأرقام التسلسلية للأجهزة والقطع الإلكترونية والكهربائية لمتابعة كفالاتها',
    },
    {
      id: 10,
      image: image,
      title: 'معالجة تاريخ الصلاحية',
      desc: 'معالجة كاملة لتاريخ الصلاحية من خلال تقارير خاصة لإظهار حركة و رصيد المواد التي تعتمد في حركتها و جردها على تاريخ الصلاحية، مع إمكانية عمل تسوية للزيادة أو النقص',
    },
    {
      id: 11,
      image: image,
      title: 'القوائم المالية وقائمة التدفق النقدي',
      desc: 'يوفر كافة التقارير المالية من موازين مراجعة وقوائم الدخل والمراكز المالية كما أن النظام يوفر إمكانية تحديد مراكز تكلفة تجميعة و توزيعية على مستوى العمليات و تأثير تلك المراكز على حسابات ومن ثم إظهارها في دفتر الأستاذ. كما يضم العديد من التقارير المحاسبية المتخصصّة ( القوائم المالية _ ميزان المراجعة_ التدفق النقدي.. الخ)، مع إمكانية إظهار الحسابات بالعديد من المستويات و احتساب فروقات العملات',
    },
    {
      id: 12,
      image: image,
      title: 'الموازنة التقديرية',
      desc: 'إمكانية التعامل مع الموزانة التقديرية مخصصّة لفترات يتم تحديدها من قبل العميل، مع إمكانية إظهار تقارير للموازنات التقديرية للحسابات و إظهار الفروقات بين الموازنات التقديرية و الفعلية',
    },
    {
      id: 13,
      image: image,
      title: 'إقفال وتدوير الأرصدة',
      desc: 'يتميز البرنامج بإمكانية إقفال الحسابات و تدوير الأرصدة بطريقة أمنة، كما و يتيح للمستخدم إمكانية تقييم الحسابات الختامية بنهاية السنة المالية.تجهيز قاعدة بيانات السنة المالية الجديدة بعد التدوير حيث يقوم البرنامج بإنشاء فاتورة بضاعة أول مدة وسند القيد الإفتتاحي.',
    },
  ];

  const props: ShowCardProps = {
    onHide,
    modalShow,
  };

  return (
    <section className='my_cards'>
      <Container>
        <Row>
          {data.map(({ id, image, title, desc }: CardType, index: number) => (
            <Col
              xs={12}
              md={6}
              lg={4}
              xl={3}
              className='custom_card'
              key={index}
              onClick={() =>
                window.localStorage.setItem(
                  'card',
                  JSON.stringify({ id, image, title, desc })
                )
              }
            >
              <figure>
                <img src={image} alt={title} loading='lazy' />
              </figure>
              <div className='my_card_body'>
                <h4 title={title}>{title}</h4>
                <p title={desc}>{desc}</p>
                <Link
                  // to={`program_features/${id}`}
                  to='/program_features'
                  className='card_btn'
                  onClick={onShow}
                >
                  إقرا المزيد...
                </Link>
              </div>
              <ShowCard {...props} />
            </Col>
          ))}
        </Row>
      </Container>
    </section>
  );
};

export default CustomCard;
