{
  "header": [
    {
      "title": "الرئيسية",
      "link": "/",
      "id": 1
    },
    {
      "title": "مزايا البرنامج",
      "link": "/program_features",
      "id": 2
    },
    {
      "title": "من نحن",
      "link": "/about_us",
      "id": 3
    },
    {
      "title": "الحصول على النسخة التجريبية",
      "link": "/beta_version",
      "id": 4
    },
    {
      "title": "اتصل بنا",
      "link": "/call_us",
      "id": 7
    },
    {
      "id": 8,
      "title": "الأدمن",
      "link": "/aram_tech/admin_control/dashboard"
    }
  ],
  "home": {
    "btn": "تواصل معنا",
    "signature": "معتمد من قبل هيئةالزكاة والضريبة",
    "introText": {
      "first": "برنامج المنارة",
      "second": "للمحاسبة",
      "third": "و المستودعات."
    },
    "advice": {
      "title": "لا يجب أن تكون إدارة جانب الأرقام في عملك صعبًا أو مرهقًا.",
      "desc_one": "مع الأنظمة الصحيحة والتوجيه المناسب ، يمكن أن تكون إدارة الشؤون المالية لأعمالك أمرًا مُمكِّنًا.",
      "desc_two": "فبدلاً من الشعور بأنك تتفوق عليه ، ستشعر بالسيطرة على أموالك ويمكنك اتخاذ قرارات أفضل بشأن عملك."
    },
    "askForm": {
      "title_one": "هل أنت مستعد للتحكم في الشؤون المالية لشركتك",
      "title_two": "والتخلص من ضغوط الوقت الضريبي؟",
      "offer": "إحصل على النسخة التجريبية الأن",
      "btn": "إطلبها الأن"
    }
  },
  "features": [
    {
      "id": 1,
      "image": "/features/currency.svg",
      "title": "تعدد العملات",
      "desc": "إمكانية التعامل مع عدد غير محدّد من العملات، مع إمكانية التحكم بأسعار الصرف وتقارير تفصيلية خاصة بالعملات و دفتر أستاذ عملة، و تقرير فروقات أسعار الصرف لتوليد قيد مباشر بفروقات الصرف المتولّدة عن العمليات المالية خلال الفترة المحاسبية"
    },
    {
      "id": 2,
      "image": "/features/assets.svg",
      "title": "إدارة الأصول",
      "desc": "تعتبر إدارة الأصول الثابتة عملية محاسبية تسعى لتتبع الأصول بغرض المحاسبة المالية، بالإضافة إلى اعتبارها المرجع الأساسي لتنظيم إدخال و اهتلاك الأصول و الممتلكات الخاصة بالمنشأة، تشمل الأصول الثابتة الأراضي و المباني و السيارات و الأثاث و المعدات المكتبية و الآلات، كما و يعتبر نظام متكامل لإدارة البيانات المتعلقة بتلك الأصول ضمن المنشأة ابتداءاً من حاجة المنشآت لإدخال أصول جديدة ومن ثم احتساب قيمة الموجودات و الإهتلاكات لها على مدار السنوات حتى انتهاء الأصل من خلال التصرف به أو استبعاده من سجلات المنشأة، بالإضافة إلى أن النظام يمتاز بسهولة وشمولية عالية في تعريف الأصول و مجموعاتها و الأقسام التابعة لها تلك الأصول"
    },
    {
      "image": "/features/warehouse.svg",
      "title": "المستودعات",
      "desc": "يتميز نظام المستودعات بإمكانية إدارة جرد لمستودعات المنشأة، و العمليات المستودعية والجرد المستمر بغض النظر عن حجم تلك المنشأة، كما ويعمل وفق آلية سلسة و تراتبية منظمة ابتداءاً من إدخال بضاعة أول المدة حتى استخراج ميزانية متكاملة، و يتميز النظام أيضاً بإمكانية حسب تكلفة المواد حسب المستودعات، و إظهار تقارير لجرد المستودعات و تقارير شهرية لحركة المواد ضمن المستودعات،و تخصيص حدود للمواد حسب المستودعات،و تفعيلها ضمن الفواتير بالإضافة إلى إمكانية التحكم بصلاحية المستخدمين من خلال موسع الصلاحيات",
      "id": 3
    },
    {
      "id": 4,
      "image": "/features/commission.svg",
      "title": "نظام العمولات للبائعين",
      "desc": "يستخدم تقرير عمولات البائعين لإظهار عمولة بائع محدّد خلال فترة زمينة معينة مع إمكانية التحكم بنوع الفواتير من خلال خيارات الإظهار و العملة المراد إظهار قيمة العمولة بها و من ثم توليد سند قيد بقيمة نتيجة العمولة, كما ويمكن من خلال تقرير عمولات البائعين التحكم بنوع العمولات المراد دفعها للبائع المحدّد من خلال خيارات التقرير حيث من الممكن احتساب عمولة واحدة فقط على الرغم من وجود عدّة أنواع للعمولات في بطاقة البائع"
    },
    {
      "id": 5,
      "image": "/features/printer.svg",
      "title": "مصمم الطباعة",
      "desc": "وجود مصمم الفاست ريبورت و الذي يعتبر أداة مساعدة لطباعة التقارير و التحكم بطريقة عرضها بما يتناسب مع رغبة وحاجة العميل"
    },
    {
      "id": 6,
      "image": "/features/support.svg",
      "title": "دعم الفروع",
      "desc": "دعم ربط نظام الفروع أياً كان موقعها مع إمكانية عمل تقارير خاصة بكل فرع حدة ( ميزانية كل فرع على حدة أو ميزان إجمالية لكامل الشركة مع فروعها"
    },
    {
      "image": "/features/chart.svg",
      "title": "المخططات البيانية",
      "desc": "يتميز بوجود مخطط بيانية لأرصدة الحسابات حسب فترات يمكن التحكم بها من قبل العميل و ذلك لاستعراض أرصدة العملاء دون العودة لتقارير البرنامج. إمكانية التحكم بطريقة عرض المخطط على سطح المكتب كمخطط أعمدة أو مخطط أعمدة ثلاثي الأبعاد و غير ذلك.",
      "id": 7
    },
    {
      "id": 8,
      "image": "/features/barcode.svg",
      "title": "الأرقام التسلسلية",
      "desc": "يتضمن البرنامج ميزة الأرقام التسلسلية للأجهزة والقطع الإلكترونية والكهربائية لمتابعة كفالاتها"
    },
    {
      "id": 9,
      "image": "/features/date.svg",
      "title": "معالجة تاريخ الصلاحية",
      "desc": "معالجة كاملة لتاريخ الصلاحية من خلال تقارير خاصة لإظهار حركة و رصيد المواد التي تعتمد في حركتها و جردها على تاريخ الصلاحية، مع إمكانية عمل تسوية للزيادة أو النقص"
    },
    {
      "id": 10,
      "image": "/features/money.svg",
      "title": "القوائم المالية وقائمة التدفق النقدي",
      "desc": "يوفر كافة التقارير المالية من موازين مراجعة وقوائم الدخل والمراكز المالية كما أن النظام يوفر إمكانية تحديد مراكز تكلفة تجميعة و توزيعية على مستوى العمليات و تأثير تلك المراكز على حسابات ومن ثم إظهارها في دفتر الأستاذ. كما يضم العديد من التقارير المحاسبية المتخصصّة ( القوائم المالية _ ميزان المراجعة_ التدفق النقدي.. الخ)، مع إمكانية إظهار الحسابات بالعديد من المستويات و احتساب فروقات العملات"
    },
    {
      "id": 11,
      "image": "/features/budget.svg",
      "title": "الموازنة التقديرية",
      "desc": "إمكانية التعامل مع الموزانة التقديرية مخصصّة لفترات يتم تحديدها من قبل العميل، مع إمكانية إظهار تقارير للموازنات التقديرية للحسابات و إظهار الفروقات بين الموازنات التقديرية و الفعلية"
    },
    {
      "id": 12,
      "image": "/features/recycle.svg",
      "title": "إقفال وتدوير الأرصدة",
      "desc": "يتميز البرنامج بإمكانية إقفال الحسابات و تدوير الأرصدة بطريقة أمنة، كما و يتيح للمستخدم إمكانية تقييم الحسابات الختامية بنهاية السنة المالية.تجهيز قاعدة بيانات السنة المالية الجديدة بعد التدوير حيث يقوم البرنامج بإنشاء فاتورة بضاعة أول مدة وسند القيد الإفتتاحي."
    }
  ],
  "about_us": {
    "image": "/about_us2.jpg",
    "title": "من نحن",
    "desc": "شركة آرام تك هو المزود الرائد لحلول البرمجيات وتطوير الشبكة . تأسست آرام تك في نهاية عام 2017.",
    "mission": {
      "title": "مهمتنا ",
      "desc": "توفير أفضل حلول البرمجيات لتناسب احتياجات ومتطلبات العملاء."
    },
    "vision": {
      "title": "رؤيتنا ",
      "desc": "تقديم الدعم الفني وخدمات ما بعد البيع لتحقيق أعلى المعايير المهنية."
    }
  },
  "video": {
    "video": "/video.mp4"
  },
  "call_us": {
    "title": "تواصل معنا",
    "desc": "تواصل معنا عبر نموذج الاتصال"
  },
  "privacy": {
    "title": "سياسة الخصوصية",
    "desc": "معلومات يتم جمعها في وضع عدم الاتصال أو عبر قنوات أخرى غير هذا الموقع. تم إنشاء سياسة الخصوصية الخاصة بنا بمساعدة منشئ سياسة الخصوصية المجانية."
  },
  "testimonials": [
    {
      "id": 1,
      "image": "string",
      "name": "المدير المالي لأرون للأزياء",
      "rate": 2,
      "desc": "بكل امانه كادر ممتاز ومتألق جدا تعامل راقي خدمات متميزه على قدر عالي من الرقي مع العملاء كل الشكر والاحترام لكم"
    },
    {
      "image": "",
      "name": "المدير التجاري - البيان والوضوح لتقنية المعلومات",
      "desc": "خدمة مميزة وسرعة في الرد، الخدمات التي يقدمها المبرمج رائعة",
      "rate": 4,
      "id": 2
    },
    {
      "id": 3,
      "image": "",
      "name": "مدير مؤسسة إبداع الحلول",
      "rate": 6,
      "desc": "فريق عمل مميز وبرنامج جدا ممتاز انا شغال على البرنامج من سنتين وانصح الجميع بإستخدام برنامج المنارة للمحاسبة والمستودعات"
    },
    {
      "image": "",
      "name": "المطبخ المتكامل",
      "desc": "تعامل وخدمة مابعد البيع جداً ممتازة اشكركم",
      "rate": 1,
      "id": 4
    },
    {
      "id": 5,
      "image": "",
      "name": "المدير المالي لمطعم مسلاتي غورمي",
      "rate": 4,
      "desc": "من أفضل الشركات التي تقدم حلولا برمجية ملائمة وعملية بأسعار مدروسة وتتميز بكادر مؤهل واحترافي وسريع التجاوب"
    }
  ],
  "footer": {
    "logo": "/Aram-Tech-PNG.png",
    "desc": "شركة آرام تك هو المزود الرائد لحلول البرمجيات وتطوير الشبكة . تأسست آرام تك في نهاية عام 2017.",
    "links": {
      "facebook": "https://web.facebook.com/almanarasoft?_rdc=1&_rdr",
      "youtube": "https://www.youtube.com/c/Almanarasoft",
      "linkedin": "https://www.linkedin.com/company/almanarasoft/"
    },
    "importantLinks": {
      "text": "موقعنا الرسمي",
      "link": {
        "name": "arambs.com",
        "url": "https://www.arambs.com/"
      },
      "privacy": {
        "name": "Privacy Policy",
        "url": "/privacy"
      }
    },
    "rights": "كل الحقوق محفوظة"
  }
}